import { inter } from "../fonts";

export default function GameMenu({ activeItem }: { activeItem: number }) {
  return (
    <div className="fixed bottom-0 left-0 right-0 bg-casino-darkGray/95 backdrop-blur-sm border-t border-casino-gold/20 z-20">
      <div className="max-w-md mx-auto px-4 py-2">
        <div className="flex justify-around">
          <button className={`nav-item ${activeItem === 1 ? "active" : ""}`} onClick={() => activeItem !== 0 ? window.location.href = "/" : ""}>
            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none" stroke="currentColor" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round" className="lucide lucide-house">
              <path d="M15 21v-8a1 1 0 0 0-1-1h-4a1 1 0 0 0-1 1v8"></path>
              <path d="M3 10a2 2 0 0 1 .709-1.528l7-5.999a2 2 0 0 1 2.582 0l7 5.999A2 2 0 0 1 21 10v9a2 2 0 0 1-2 2H5a2 2 0 0 1-2-2z"></path>
            </svg>
            <span className={"text-xs mt-1 " + inter.className}>Слоты</span>
          </button>
          <button className={`nav-item ${activeItem === 2 ? "active" : ""}`} onClick={() => activeItem !== 1 ? window.location.href = "/games" : ""}>
            <svg version="1.0" xmlns="http://www.w3.org/2000/svg"
              width="24" height="24" viewBox="0 0 512.000000 512.000000"
              preserveAspectRatio="xMidYMid meet"
              className="nav-icon"> {/* Добавьте класс */}

              <g transform="translate(0.000000,512.000000) scale(0.100000,-0.100000)">
                {/* Убраны fill и stroke из тега g */}
                <path d="M2030 4990 l0 -129 -42 -11 c-182 -46 -456 -168 -627 -280 -458 -299 -790 -762 -925 -1291 -51 -197 -69 -343 -68 -554 0 -567 213 -1095 609 -1516 136 -144 365 -317 535 -404 l78 -40 0 -232 0 -233 -130 0 -130 0 0 -150 0 -150 1230 0 1230 0 0 150 0 150 -130 0 -130 0 0 230 0 229 48 27 c150 86 213 126 299 191 466 349 769 863 858 1458 23 149 23 432 1 590 -120 843 -698 1535 -1498 1793 l-148 47 0 128 0 127 -530 0 -530 0 0 -130z m760 -242 l0 -71 -115 -116 -115 -116 -115 116 -115 116 0 71 0 72 230 0 230 0 0 -72z m-637 -316 l119 -119 -74 -18 c-327 -79 -627 -256 -836 -495 -340 -386 -479 -909 -372 -1402 140 -646 655 -1137 1311 -1249 172 -29 442 -23 599 14 325 77 562 207 791 436 284 284 440 624 468 1021 42 576 -238 1141 -719 1453 -157 101 -329 176 -498 218 l-93 22 119 120 120 119 83 -27 c109 -36 307 -130 400 -190 403 -261 687 -642 813 -1091 53 -191 61 -253 61 -509 0 -212 -3 -253 -23 -355 -140 -689 -619 -1233 -1278 -1449 -215 -71 -316 -86 -574 -86 -241 0 -296 6 -488 56 -453 116 -859 409 -1115 804 -218 338 -326 756 -297 1153 49 680 444 1272 1045 1568 99 49 284 122 310 124 6 0 63 -53 128 -118z m541 -402 c116 -14 226 -39 226 -52 0 -6 -66 -167 -147 -359 l-148 -349 -60 0 -61 0 -146 358 c-93 229 -141 359 -134 364 11 7 164 35 226 41 75 8 159 6 244 -3z m-616 -510 c78 -192 142 -353 142 -357 0 -5 -19 -27 -42 -49 l-43 -41 -352 150 c-194 82 -353 153 -353 158 0 26 119 180 209 270 95 95 257 219 287 219 6 0 75 -157 152 -350z m1218 289 c103 -67 275 -240 347 -350 31 -47 57 -90 57 -95 0 -5 -160 -74 -356 -153 l-356 -144 -43 44 -44 44 144 337 c78 186 145 344 149 353 8 22 16 20 102 -36z m-1313 -996 l37 -15 0 -62 0 -62 -356 -144 c-281 -113 -358 -140 -364 -130 -5 8 -16 55 -26 105 -23 122 -23 331 1 455 30 159 -14 159 352 3 175 -74 335 -141 356 -150z m1852 195 c37 -161 36 -387 -1 -561 -14 -66 -20 -78 -35 -74 -10 3 -171 69 -358 148 l-341 144 0 61 0 62 113 46 c130 53 601 245 604 246 1 0 9 -33 18 -72z m-1166 -63 c167 -84 176 -321 17 -420 -44 -27 -58 -30 -126 -30 -68 0 -82 3 -126 30 -161 100 -149 339 21 424 59 30 152 28 214 -4z m-492 -597 l41 -43 -148 -348 c-82 -192 -151 -351 -154 -355 -13 -12 -186 117 -277 208 -81 81 -219 263 -219 289 0 5 64 34 143 66 78 32 232 95 342 140 110 46 207 84 215 84 9 1 34 -18 57 -41z m1173 -113 c179 -75 329 -141 334 -146 16 -15 -103 -178 -204 -279 -80 -81 -263 -220 -289 -220 -4 0 -72 160 -151 356 l-143 355 43 44 c35 35 47 42 64 35 11 -4 167 -70 346 -145z m-620 -322 c62 -153 127 -314 145 -358 39 -94 48 -85 -104 -110 -77 -13 -139 -16 -254 -13 -143 5 -288 27 -311 49 -5 5 53 154 139 359 l149 350 62 0 62 0 112 -277z m-711 -1308 c206 -53 269 -60 541 -60 204 0 275 4 355 19 95 17 260 57 298 71 16 7 17 -5 17 -164 l0 -171 -670 0 -670 0 0 171 c0 153 2 170 16 165 9 -3 60 -17 113 -31z" />
              </g>
            </svg>
            <span className={"text-xs mt-1 " + inter.className}>Рулетка</span>
          </button>
          <button className={`nav-item ${activeItem === 3 ? "active" : ""}`} onClick={() => activeItem !== 2 ? window.location.href = "/quests" : ""}>
            <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none" stroke="currentColor" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round" className="lucide lucide-trophy">
              <path d="M6 9H4.5a2.5 2.5 0 0 1 0-5H6"></path>
              <path d="M18 9h1.5a2.5 2.5 0 0 0 0-5H18"></path>
              <path d="M4 22h16"></path>
              <path d="M10 14.66V17c0 .55-.47.98-.97 1.21C7.85 18.75 7 20.24 7 22"></path>
              <path d="M14 14.66V17c0 .55.47.98.97 1.21C16.15 18.75 17 20.24 17 22"></path>
              <path d="M18 2H6v7a6 6 0 0 0 12 0V2Z"></path>
            </svg>
            <span className={"text-xs mt-1 " + inter.className}>КМН</span>
          </button>
        </div>
      </div>
    </div>
  )
}